import pandas as pd

In [2]:
filepath = "datafiles/data.xlsx"
df=pd.read_excel(filepath)

In [3]:
df

       name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000

##Grouping and Aggregation
we group our data by department

In [6]:
grouped = df.groupby("department")

In [7]:
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000211F2C31D60>

In [9]:
df.groupby("department")

In [10]:
df.groupby("department")['salary'].mean()

department
Engineering    68000.000000
HR             51250.000000
Sales          55333.333333
Name: salary, dtype: float64

In [12]:
df.groupby('department').agg({
'salary': ['sum','mean','count','min','max','std','var','median'],
})

             salary                                                 \
                sum          mean count    min    max          std
department
Engineering  272000  68000.000000     4  60000  80000  9092.121131
HR           205000  51250.000000     4  50000  52000   957.427108
Sales        166000  55333.333333     3  53000  58000  2516.611478


                      var   median
department
Engineering  8.266667e+07  66000.0
HR           9.166667e+05  51500.0
Sales        6.333333e+06  55000.0

In [16]:
df.groupby('department').agg({
'age':['sum','mean','count','min','max','std','var','median'],
})

             age
             sum       mean count min max       std        var median
department
Engineering  118  29.500000     4  24  35  4.654747  21.666667   29.5
HR           122  30.500000     4  29  34  2.380476   5.666667   29.5
Sales         76  25.333333     3  23  27  2.081666   4.333333   26.0